content/euler/4.md
+++
title = "Project Euler 4: Largest Palindrome Product"
author = ["Gautam Manohar"]
description = "My solution to problem 4 of Project Euler."
date = 2018-06-10
tags = ["brute-force"]
categories = ["euler"]
draft = false
+++

## Problem Statement {#problem-statement}

A palindromic number reads the same both ways. The smallest 6 digit palindrome
made from the product of two 3-digit numbers is \\(101101 = 143 \cdot 707\\). Find
the largest palindrome made from the product of two 3-digit numbers which is
less than \\(N\\).


## My Algorithm {#my-algorithm}

We compute all products \\(ij\\) of numbers \\(100 \le i,j \le 999\\) and keep the
palindromic ones. Then we sort the palindromic products and perform a binary
search for the greatest element of the array strictly less than \\(N\\). The only
tricky thing here is to remember that if \\(N\\) is in the array of palindromic
products, we must return the element directly before \\(N\\).